app/controllers/welcome_controller.rb

SELECT  `todo_lists`.* FROM `todo_lists`  ORDER BY `todo_lists`.`id` DESC LIMIT 6
---
  def dashboard
    @groups=Group.all
    @servers= Server.all
    @todoList= TodoList.last(6)

SELECT `temps`.* FROM `temps` WHERE (`temps`.`mark` = 1 OR `temps`.`mark` IS NULL)  ORDER BY created_at DESC
SELECT COUNT(*) FROM `temps` WHERE `temps`.`mark` = 1
---
  def alarms
    @alarms=Temp.all.where(:mark => [nil, true]).order("created_at DESC")
    @alarms.each do |a|
      a.mark=false
      a.save
    end
    $xaslogger.info "Welcome controller/alarms action : #{@alarms.size} get values from database as a new mark"