app/controllers/xas_sets_controller.rb

  def set_xas_set
    @xas_set = XasSet.find(params[:id])
---
SELECT  `xas_sets`.* FROM `xas_sets` WHERE `xas_sets`.`id` = 3 LIMIT 1