app/views/layouts/_application_header.html.erb

SELECT COUNT(*) FROM `temps` WHERE `temps`.`mark` = 1
---
            <i class="fa fa-envelope"></i>
            <span class="label label-success"><%= Temp.all.where(:mark => true).count %></span>